{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "chao_hoi",
    "1": "tam_biet",
    "2": "hoi_khuyen_mai",
    "3": "cam_on",
    "4": "xin_loi",
    "5": "tao_don",
    "6": "kiem_tra_don",
    "7": "huy_don",
    "8": "theo_doi_don",
    "9": "ho_tro",
    "10": "thoi_gian_giao",
    "11": "hoi_gio_lam_viec",
    "12": "tinh_phi_giao_hang",
    "13": "doi_dia_chi",
    "14": "phuong_thuc_thanh_toan",
    "15": "truyen_thong",
    "16": "khong_lien_quan",
    "17": "gop_y",
    "18": "ho_tro_dang_nhap",
    "19": "huong_dan_gui_hang"
  },
  "initializer_range": 0.02,
  "label2id": {
    "cam_on": 3,
    "chao_hoi": 0,
    "doi_dia_chi": 13,
    "gop_y": 17,
    "ho_tro": 9,
    "ho_tro_dang_nhap": 18,
    "hoi_gio_lam_viec": 11,
    "hoi_khuyen_mai": 2,
    "huong_dan_gui_hang": 19,
    "huy_don": 7,
    "khong_lien_quan": 16,
    "kiem_tra_don": 6,
    "phuong_thuc_thanh_toan": 14,
    "tam_biet": 1,
    "tao_don": 5,
    "theo_doi_don": 8,
    "thoi_gian_giao": 10,
    "tinh_phi_giao_hang": 12,
    "truyen_thong": 15,
    "xin_loi": 4
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.40.1",
  "vocab_size": 30522
}
