{
  "_name_or_path": "vinai/phobert-base",
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "chao_hoi",
    "1": "tam_biet",
    "2": "hoi_khuyen_mai",
    "3": "cam_on",
    "4": "xin_loi",
    "5": "tao_don",
    "6": "kiem_tra_don",
    "7": "huy_don",
    "8": "theo_doi_don",
    "9": "ho_tro",
    "10": "thoi_gian_giao",
    "11": "hoi_gio_lam_viec",
    "12": "tinh_phi_giao_hang",
    "13": "doi_dia_chi",
    "14": "phuong_thuc_thanh_toan",
    "15": "truyen_thong",
    "16": "khong_lien_quan",
    "17": "gop_y",
    "18": "ho_tro_dang_nhap",
    "19": "huong_dan_gui_hang"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "cam_on": 3,
    "chao_hoi": 0,
    "doi_dia_chi": 13,
    "gop_y": 17,
    "ho_tro": 9,
    "ho_tro_dang_nhap": 18,
    "hoi_gio_lam_viec": 11,
    "hoi_khuyen_mai": 2,
    "huong_dan_gui_hang": 19,
    "huy_don": 7,
    "khong_lien_quan": 16,
    "kiem_tra_don": 6,
    "phuong_thuc_thanh_toan": 14,
    "tam_biet": 1,
    "tao_don": 5,
    "theo_doi_don": 8,
    "thoi_gian_giao": 10,
    "tinh_phi_giao_hang": 12,
    "truyen_thong": 15,
    "xin_loi": 4
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 258,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "tokenizer_class": "PhobertTokenizer",
  "torch_dtype": "float32",
  "transformers_version": "4.40.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 64001
}
